app/Models/Contact_model.php

SELECT *
FROM `contacts`
WHERE `user_id` = '15'
ORDER BY `created_at` DESC
 LIMIT 1
---
    public function get_recently_added_contact($user_id)
    {
        return $this->where('user_id', $user_id)
                    ->orderBy('created_at', 'DESC')
                    ->first();

SELECT `image_location`
FROM `contacts`
WHERE `id` = '517'
---
    public function get_image_location($contact_id)
    {
        $image_row = $this->select('image_location')
                          ->where('id', $contact_id)
                          ->get()
                          ->getRow();

SELECT COUNT(*) AS `numrows`
FROM `contacts`
WHERE `user_id` = '13'
---
    public function count_total_row($user_id){

           return $this->where('user_id', $user_id)
                ->countAllResults();

SELECT *
FROM `contacts`
WHERE `user_id` = '15'
ORDER BY `created_at` ASC
 LIMIT 8, 8
---
    public function get_all_contacts_with_offset($user_id, $current_page)
    {

    $totalRows = $this->count_total_row($user_id);

    if ($totalRows == 0) {
        return null;
    }

    $maxPageNumber = $this->count_max_page($user_id);
    $startFrom = ($current_page - 1) * 8;

    if ($startFrom >= $totalRows) {
        $startFrom = ($maxPageNumber - 1) * 8;
    }

    $result = $this->where('user_id', $user_id)
                   ->orderBy('created_at', 'ASC')
                   ->limit(8, $startFrom)
                   ->findAll();

SELECT `image_location`
FROM `contacts`
WHERE `id` = 517
UPDATE `contacts` SET `name` = 'rezDqSLfKtNGcT', `address` = 'nAUdmFG31sYLx4kuDXS0bOCyZcPRITvJrHQgowaN97Vl65jzMp', `email` = 'EH2fYpFN0dqA8Qo@alnum.com', `phone_number` = '2349680517', `remark` = 'seQSxgHqZrRvDfVFJjPwGtAnEhbKal', `user_id` = '15', `image_location` = '/assets/img/empty-profile-picture.webp'
WHERE `id` = 517
---
    public function update_contact($contact_id, $data)
    {
        $contact_id = intval($contact_id);
        $image_row = $this->select('image_location')
                          ->where('id', $contact_id)
                          ->get()
                          ->getRow();
        $image_location = $image_row->image_location;


$result = $this->db->table('contacts')->where('id', $contact_id)->update($data);

SELECT `image_location`
FROM `contacts`
WHERE `user_id` = '13'
AND `phone_number` = '1135051183'
DELETE FROM `contacts`
WHERE `user_id` = '13'
AND `phone_number` = '1135051183'
---
    public function delete_contact_by_phone_with_user_id($phone_number,$user_id)
    {
    $image_location = $this->select('image_location')
                           ->where('user_id', $user_id)
                           ->where('phone_number', $phone_number)
                           ->get()
                           ->getRow()
                           ->image_location;

    $result = $this->where('user_id', $user_id)
         ->where('phone_number', $phone_number)
         ->delete();

SELECT *
FROM `contacts`
WHERE `phone_number` = '2349680517'
AND `user_id` = '15'
 LIMIT 1
---
    public function get_contact_by_phone_with_user_id($phone_number, $user_id)
    {

        $result = $this->where('phone_number', $phone_number)
        ->where('user_id', $user_id)
        ->first();

SELECT `id`
FROM `contacts`
WHERE `user_id` = '15'
AND `phone_number` = '2349680517'
 LIMIT 1
---
    public function get_contact_id($phone_number, $user_id)
    {
        $result = $this->select('id')
        ->where('user_id', $user_id)
        ->where('phone_number', $phone_number)
        ->limit(1)
        ->get()
        ->getRow();